Revit 2027 API
ParameterTypeId.BendingDetailRepresentationFor3dBars Property
 "View for 3D Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailRepresentationFor3dBars { get; }
Public Shared ReadOnly Property BendingDetailRepresentationFor3dBars As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailRepresentationFor3dBars {
	ForgeTypeId^ get ();
}
static member BendingDetailRepresentationFor3dBars : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace